keyraphi/esp8266_infrasound/esp8266_infrasound_webservre/esp8266_infrasound_webserver.ino.cpp
#include <Arduino.h>
#include <AsyncJson.h>
#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <NTPClient.h>
#include <SdFat.h>
#include <SoftwareSerial.h>
#include <WiFiUdp.h>
#include <circular_queue/circular_queue.h>
#include <cstddef>
#include <cstdint>
#include <cstring>
#include <iostream/ArduinoStream.h>
#include <strings.h>

#define SPI_SPEED SD_SCK_MHZ(4)
#define MYPORT_TX 5
#define MYPORT_RX 4

EspSoftwareSerial::UART esp_serial;

String ssid;
String password;
AsyncWebServer server(80);
AsyncEventSource events("/measurement_events");

WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org");
const char *wifi_acces_file_path = "wifi_ssid_pw.txt";

// SSD Chip Select pin
const int sd_chip_select = SS;
SdFs sd;
FsFile measurement_file;

// Printing and reading from USB with cout and cin
ArduinoOutStream cout(Serial);
// input buffer for line
char cinBuf[32];
ArduinoInStream cin(Serial, cinBuf, sizeof(cinBuf));

// Some global variables to enable or disable features based on connected
// hardware
bool is_sd_card_available = false;
bool is_wifi_client = false;
bool is_json_finalized = false;
uint64_t start_timestamp = 0;
volatile bool is_measurement_running = false;
volatile bool create_new_measurement_file = true;

// Some global variables and buffers
// ring buffer to buffer new measurements
circular_queue<float> measurements_buffer(32);
// ring buffer to buffer indices for those measurements
circular_queue<uint32_t> indices_buffer(32);
// measurement file buffer
const int measurement_file_buffer_size = 256;
float measurement_file_buffer[measurement_file_buffer_size];
uint32_t measurements_in_file_buffer = 0;

String measurement_file_name;
uint32_t measurements_returned_already = 0;

IPAddress local_IP(192, 168, 4, 1);
IPAddress gateway(192, 168, 4, 1);
IPAddress subnet(255, 255, 255, 0);

// forward declarations
void initWifi();
void initWebserver();
void pollSensorISR();
bool openMeasurementFileAppending();

void reformatMsg() {
  cout << F("Try reformatting the card.  For best results use\n");
  cout << F("the SdFormatter program in SdFat/examples or download\n");
  cout << F("and use SDFormatter from www.sdcard.org/downloads.\n");
}

// void hardwareTimerHandler() { ISR_Timer.run(); }

bool initSdCard() {
  cout << "Initializing SD card" << endl;
  if (!sd.begin(sd_chip_select, SPI_SPEED)) { // this crashes the board - try
                                              // with connected sd module!
    if (sd.card()->errorCode()) {
      cout << F("\nSD initialization failed.\n"
                "Do not reformat the card!\n"
                "Is the card correctly inserted?\n"
                "Is chipSelect set to the correct value?\n"
                "Does another SPI device need to be disabled?\n"
                "Is there a wiring/soldering problem?\n");
      cout << F("\nerrorCode: ") << hex << showbase;
      cout << int(sd.card()->errorCode());
      cout << F(", errorData: ") << int(sd.card()->errorData());
      cout << dec << noshowbase << endl;
      return false;
    }
    cout << F("\nCard successfully initialized.\n");
    if (sd.vol()->fatType() == 0) {
      cout << F("Can't find a valid FAT16/FAT32/exFAT partition.\n");
      reformatMsg();
      return false;
    }
    cout << F("Can't determine error type\n");
    return false;
  }
  cout << F("\nCard successfully initialized.\n");
  cout << endl;
  is_sd_card_available = true;
  return true;
}

bool load_wifi_credentials() {
  cout << "Loading WiFi credentials from SDCard" << endl;
  FsFile wifi_credential_file;
  if (!wifi_credential_file.open(wifi_acces_file_path, O_RDONLY)) {
    cout << "WiFi credential file does not exist: " << wifi_credential_file
         << endl;
    return false;
  }
  cout << "Loading WiFi credentials" << endl;
  char buffer;
  // read ssid
  ssid = "";
  while (wifi_credential_file.read(&buffer, 1) >= 1) {
    if (buffer == '\n') {
      break;
    }
    ssid += buffer;
  }
  // read password
  password = "";
  while (wifi_credential_file.read(&buffer, 1) >= 1) {
    if (buffer == '\n') {
      break;
    }
    password += buffer;
  }
  wifi_credential_file.close();
  cout << "Loaded WiFi credentials for ssid: " << ssid << endl;
  return true;
}

bool write_wifi_credentials() {
  cout << "Writing WiFi credentials for ssid:" << ssid << endl;
  FsFile wifi_credential_file;
  if (!wifi_credential_file.open(wifi_acces_file_path, O_WRONLY | O_CREAT)) {
    return false;
  }
  wifi_credential_file.print(ssid + "\n" + password + "\n");
  wifi_credential_file.close();
  return true;
}

void onNotFound(AsyncWebServerRequest *request) {
  cout << "A unknown request was sent" << endl;
  request->send(404, "text/plain", "Not found");
}

// buffer_size must be at least 30 bytes large
int generateMeasurementJson(uint8_t *buffer, size_t buffer_size,
                            uint32_t number_of_measurements,
                            uint32_t next_start_idx,
                            uint32_t bytes_to_seek_measurement) {
  // If measurement_file are open currently... close them and
  // remember to open them before leaving this function
  bool closed_measurement_file = false;
  if (measurement_file.isOpen()) {
    measurement_file.close();
    closed_measurement_file = true;
  }
  FsFile value_file;
  if (!value_file.open(measurement_file_name.c_str(), O_RDONLY)) {
    cout << "Failed to open measurement file " << measurement_file_name << endl;
    return 0;
  }

  // Seek to the next measurements
  if (!value_file.seek(bytes_to_seek_measurement +
                       measurements_returned_already * 4)) {
    cout << "Failed to seek "
         << bytes_to_seek_measurement + measurements_returned_already * 4
         << " bytes in " << measurement_file_name << endl;
    if (closed_measurement_file) {
      openMeasurementFileAppending();
    }
    value_file.close();
    return 0;
  }

  size_t bytes_in_buffer = 0;
  char number_buffer[21];

  if (measurements_returned_already == 0) {
    memcpy(buffer + bytes_in_buffer, "{\n\"preassure\":[", 15);
    bytes_in_buffer += 15;
  }
  float preassure;
  while (measurements_returned_already < number_of_measurements) {
    if (value_file.read(&preassure, 4) < 4) {
      // there are no more timestamps in the file
      cout << "WARNING: File ran out of measurements" << endl;
      value_file.close();
      return bytes_in_buffer;
    }
    // convert preassure into asci - left aligned string
    dtostrf(preassure, -1, 7, number_buffer);
    uint32_t digits = strlen(number_buffer);
    memcpy(buffer + bytes_in_buffer, number_buffer, digits);
    bytes_in_buffer += digits;
    ++measurements_returned_already;
    if (measurements_returned_already == number_of_measurements) {
      buffer[bytes_in_buffer++] = ']';
      buffer[bytes_in_buffer++] = ',';
      buffer[bytes_in_buffer++] = '\n';
    } else {
      buffer[bytes_in_buffer++] = ',';
      if (buffer_size - bytes_in_buffer < 23) {
        // potentially not enough space in buffer for next measurement
        value_file.close();
        if (closed_measurement_file) {
          openMeasurementFileAppending();
        }
        return bytes_in_buffer;
      }
    }
  }

