keyraphi/esp8266_infrasound/esp8266_infrasound_webservre/esp8266_infrasound_webserver.ino.cpp
  if (bytes_in_buffer == 0 && is_json_finalized) {
    measurements_returned_already = 0;
    value_file.close();
    is_json_finalized = false;
    if (closed_measurement_file) {
      openMeasurementFileAppending();
    }
    return bytes_in_buffer;
  }

  if (bytes_in_buffer - buffer_size < 39) {
    is_json_finalized = false;
    value_file.close();
    if (closed_measurement_file) {
      openMeasurementFileAppending();
    }
    return bytes_in_buffer;
  }
  value_file.close();
  memcpy(buffer + bytes_in_buffer, "\"next_start_idx\":", 17);
  bytes_in_buffer += 17;
  // convert next_start_idx into asci
  size_t string_start_idx = sizeof(number_buffer) - 1;
  number_buffer[string_start_idx] = '\0';
  do {
    number_buffer[--string_start_idx] =
        next_start_idx % 10 + '0'; // add '0' = 48 in ascii
    next_start_idx /= 10;
  } while (next_start_idx != 0);
  size_t digit_count = sizeof(number_buffer) - 1 - string_start_idx;
  memcpy(buffer + bytes_in_buffer, number_buffer + string_start_idx,
         digit_count);
  bytes_in_buffer += digit_count;

  memcpy(buffer + bytes_in_buffer, "\n}", 2);
  bytes_in_buffer += 2;
  is_json_finalized = true;

  if (closed_measurement_file) {
    openMeasurementFileAppending();
  }
  return bytes_in_buffer;
}

void onGetMeasurement(AsyncWebServerRequest *request) {
  cout << "/measurements were requested" << endl;
  uint32_t start_with_idx, max_length;
  if (request->hasParam("start_with_idx")) {
    String start_with_idx_str = request->getParam("start_with_idx")->value();
    char *end_ptr;
    start_with_idx = strtoul(start_with_idx_str.c_str(), &end_ptr, 10);
  } else {
    cout << "INFO: /measurement request doesn't have start_with_idx" << endl;
    start_with_idx = 0;
  }
  if (request->hasParam("max_length")) {
    String max_length_str = request->getParam("max_length")->value();
    char *end_ptr;
    max_length = strtoul(max_length_str.c_str(), &end_ptr, 10);
  } else {
    cout << "WARNING: /measurement request doesn't have max_length" << endl;
    max_length = 5000;
  }

  // Find out where to seek for the first measurement
  FsFile value_file;
  if (!value_file.open(measurement_file_name.c_str(), O_RDONLY)) {
    cout << "Failed to open measurement file: " << measurement_file_name
         << endl;
    request->send(500);
    return;
  }
  // seek to starting point in files such that mx_length timestamp/measurement
  // pairs are returned
  uint32_t n_measurements_in_file = (uint32_t)value_file.fileSize() / 4;
  max_length = min(max_length, n_measurements_in_file);
  uint32_t seek_to_measurement =
      max(start_with_idx, n_measurements_in_file - max_length);
  // recompute how many measurements should be read:
  max_length = n_measurements_in_file - seek_to_measurement;
  uint32_t next_start_idx = start_with_idx + max_length;
  // seek accordingly
  uint32_t bytes_to_seek_measurement = seek_to_measurement * 4;
  value_file.close();

  // Respond in chunks to not block the esp completely
  AsyncWebServerResponse *response = request->beginChunkedResponse(
      "application/json",
      [max_length = max_length, next_start_idx = next_start_idx,
       bytes_to_seek_measurement = bytes_to_seek_measurement](
          uint8_t *buffer, size_t maxLen, size_t index) -> size_t {
        return generateMeasurementJson(buffer, maxLen, max_length,
                                       next_start_idx,
                                       bytes_to_seek_measurement);
      });
  response->addHeader("InfrasoundSensor", "ESP Infrasound sensor webserver");
  request->send(response);
}

void onGetDownloads(AsyncWebServerRequest *request) {
  AsyncJsonResponse *response = new AsyncJsonResponse();
  response->addHeader("InfrasoundSensor", "ESP Infrasound sensor webserver");
  JsonObject root = response->getRoot();
  JsonArray file_list = root["files"].to<JsonArray>();

  FsFile directory;
  directory.open("/measurements", O_RDONLY);
  directory.rewind();
  FsFile file;
  char file_name[29];
  while (file.openNext(&directory, O_RDONLY)) {
    if (!file.isHidden()) {
      file.getName(file_name, sizeof(file_name));
      // if (strcmp(&file_name[strlen(file_name) - 2], "ms") == 0) {
      //   continue;
      // }
      cout << "DEBUG: " << file_name << endl;
      file_list.add(file_name);
    }
    file.close();
  }
  response->setLength();
  request->send(response);
}

void onDownload(AsyncWebServerRequest *request) {
  if (!request->hasParam("file")) {
    request->send(500);
  }
  String file_name = request->getParam("file")->value();
  cout << "Sending file " << file_name << " in a chunked response." << endl;

  AsyncWebServerResponse *response = request->beginChunkedResponse(
      "audio/wav",
      [file_name = file_name](uint8_t *buffer, size_t maxLen,
                              size_t index) -> size_t {
        FsFile file;
        if (!file.open(("/measurements/" + file_name).c_str(), O_RDONLY)) {
          cout << "Error: could not open file " << "/measurements/" + file_name << endl;
          return 0;
        }

        uint32_t offset = 0;
        // seek to current position
        if (index == 0) {
          memcpy(buffer, "data", 4);
          uint32_t file_size = file.fileSize();
          memcpy(buffer + 4, reinterpret_cast<char *>(&file_size), 4);
          maxLen -= 8;
          offset = 8;
        }
        file.seek(index);
        size_t bytes_read = file.read(buffer + offset , maxLen);
        file.close();
        return bytes_read;
      });

  char name_buffer[28 + file_name.length()];
  memcpy(name_buffer + 0, "attachment; filename=\"", 22);
  memcpy(name_buffer + 22, file_name.c_str(), file_name.length());
  memcpy(name_buffer + 22 + file_name.length(), ".raw\"\0", 6);

  response->addHeader("Content-Disposition", name_buffer);

  // add file size to header
  FsFile file;
  if (!file.open(("/measurements/" + file_name).c_str(), O_RDONLY)) {
    cout << "Error: could not open file " << "/measurements/" + file_name << endl;
    request->send(500);
    return;
  }
  uint64_t file_size_bytes = file.fileSize();
  file.close();
  file_size_bytes += 8;  // for header
  char length_buffer[29];
  snprintf(length_buffer, 29, "%llu", file_size_bytes);
  response->addHeader("Content-Length", length_buffer);

  request->send(response);
}

void onStaticFile(AsyncWebServerRequest *request) {
  String url = request->url();
  String contentType;
  if (url.endsWith(".html"))
    contentType = "text/html";
  else if (url.endsWith(".js"))
    contentType = "application/javascript";
  else if (url.endsWith(".wasm"))
    contentType = "application/wasm";
  else if (url.endsWith(".ico"))
    contentType = "image/x-icon";
  else
    contentType = "text/plain";

  String ssd_path = "/www/static" + url;

  // send 128 bytes as html text
  AsyncWebServerResponse *response = request->beginChunkedResponse(
      contentType.c_str(),
      [ssd_path = ssd_path](uint8_t *buffer, size_t maxLen,
                            size_t index) -> size_t {
        FsFile html_file;
        if (!html_file.open(ssd_path.c_str(), O_RDONLY)) {
          cout << "Failed to open html_file" << endl;
          return 0;
        }
        if (!html_file.seek(index)) {
          cout << "Failed to seek in html_file" << endl;
        }
        size_t read_bytes = html_file.read(buffer, maxLen);
        html_file.close();
        return read_bytes;
      });
  response->addHeader("InfrasoundSensor", "ESP Infrasound sensor webserver");
  request->send(response);
}

void onIndex(AsyncWebServerRequest *request) {
  String RedirectUrl = "http://";
  if (ON_STA_FILTER(request)) {
    RedirectUrl += WiFi.localIP().toString();
    RedirectUrl += "/index.html";
  } else {
    RedirectUrl += WiFi.softAPIP().toString();
    RedirectUrl += "/wifi.html";
  }
  request->redirect(RedirectUrl);
}

