keyraphi/esp8266_infrasound/esp8266_infrasound_webservre/esp8266_infrasound_webserver.ino.cpp
void onPostWifi(AsyncWebServerRequest *request) {
  cout << "/set_wifi credentials were sent" << endl;
  int params = request->params();
  for (int i = 0; i < params; i++) {
    AsyncWebParameter *p = request->getParam(i);
    if (p->isPost()) {
      if (p->name() == "ssid") {
        ssid = p->value();
      } else if (p->name() == "password") {
        password = p->value();
      }
    }
  }
  if (ssid.length() == 0) {
    cout << "SSID length is 0... ignoring data" << endl;
    request->send(200);
    return;
  }
  if (write_wifi_credentials()) {
    cout << "WiFi credentials successfully updated ... restarting" << endl;
    ESP.restart();
  } else {
    cout << "Couldn't write WiFi credentials" << endl;
    request->send(200);
  }
}

void onConnect(AsyncEventSourceClient *client) {
  if (client->lastId()) {
    cout << "Client " << client->lastId() << " has reconnected" << endl;
  } else {
    cout << "A client has connected to the measurement event" << endl;
  }
}

void onStartTimestamp(AsyncWebServerRequest *request) {
  AsyncResponseStream *response = request->beginResponseStream("text/plain");
  response->printf("%llu", start_timestamp);
  request->send(response);
}

void onStartMeasurement(AsyncWebServerRequest *request) {
  AsyncResponseStream *response = request->beginResponseStream("text/plain");
  if (!is_measurement_running) {
    cout << "Starting measurement" << endl;
    create_new_measurement_file = true;
  } else {
    cout << "Measurements are already running" << endl;
  }
  is_measurement_running = true;
  request->send(200);
}

void onStopMeasurement(AsyncWebServerRequest *request) {
  AsyncResponseStream *response = request->beginResponseStream("text/plain");
  if (is_measurement_running) {
    cout << "Stopping measurement" << endl;
  } else {
    cout << "Measurements are already stopped" << endl;
  }
  is_measurement_running = false;
  request->send(200);
}

void initWebserver() {

  cout << "Serving static files" << endl;
  server.on("/", HTTP_GET, onIndex);
  server.on("/index.html", HTTP_GET, onStaticFile);
  server.on("/downloads.html", HTTP_GET, onStaticFile);
  server.on("/wifi.html", HTTP_GET, onStaticFile);
  server.on("/download_client.js", HTTP_GET, onStaticFile);
  server.on("/infrasound_client.js", HTTP_GET, onStaticFile);
  server.on("/favicon.ico", HTTP_GET, onStaticFile);
  server.on("/pffft/pffft.js", HTTP_GET, onStaticFile);
  server.on("/pffft/pffft.wasm", HTTP_GET, onStaticFile);

  cout << "Serving /measurements" << endl;
  server.on("/measurements", HTTP_GET, onGetMeasurement);
  cout << "serving /downloads" << endl;
  server.on("/downloads", HTTP_GET, onGetDownloads);
  cout << "serving /download" << endl;
  server.on("/download", HTTP_GET, onDownload);
  cout << "serving /set_wifi" << endl;
  server.on("/set_wifi", HTTP_POST, onPostWifi);
  cout << "serving /start_timestamp" << endl;
  server.on("/start_timestamp", HTTP_GET, onStartTimestamp);
  cout << "serving /start_measurements" << endl;
  server.on("/start_measurements", HTTP_GET, onStartMeasurement);
  cout << "serving /stop_measurements" << endl;
  server.on("/stop_measurements", HTTP_GET, onStopMeasurement);
  server.onNotFound(onNotFound);

  cout << "Setting up handler for /measurement_event" << endl;
  events.onConnect(onConnect);
  server.addHandler(&events);

  server.begin();
}

void configureAccessPoint() {
  while (!WiFi.softAPConfig(local_IP, gateway, subnet)) {
    cout << "Failed - trying again" << endl;
  }
  cout << "Setting up access point 'infrasound-sensor'" << endl;
  while (!WiFi.softAP("infrasound-sensor")) {
    cout << "Failed - trying again" << endl;
  }
  cout << "Access point was set up." << endl;
  cout << "SSID: 'infrasound-sensor', no password, IP-Address:"
       << WiFi.softAPIP().toString() << endl;
}

void initWifi() {
  // Try loading wifi credentials
  bool successfully_read_wifi_credentials = load_wifi_credentials();
  if (successfully_read_wifi_credentials) {
    // establish connection
    WiFi.mode(WIFI_STA);
    WiFi.begin(ssid, password);
  }
  if (WiFi.waitForConnectResult() != WL_CONNECTED) {
    cout << "Failed to connect to: " << ssid << endl;
    cout << "Configuring own Network Access Point" << endl;
    configureAccessPoint();
    is_wifi_client = false;
    return;
  }
  cout << "IP Address: " << WiFi.localIP().toString() << endl;
  is_wifi_client = true;
}

void initTimestamp() {
  cout << "Initializing start-timestamp" << endl;
  timeClient.begin();
  timeClient.update();
  time_t epochTime = timeClient.getEpochTime();
  start_timestamp = epochTime * 1000 - millis();
  cout << "Starttimestamp is " << start_timestamp << " ms" << endl;
}

String millisecondsToTimeString(uint64_t milliseconds) {
  // Convert milliseconds to seconds
  uint64_t seconds = milliseconds / 1000;

  // Get time components
  uint16_t year, month, day, hour, minute, second, millisecond;
  time_t time_t_seconds = seconds;
  struct tm *timeinfo = localtime(&time_t_seconds);

  year = timeinfo->tm_year + 1900;
  month = timeinfo->tm_mon + 1;
  day = timeinfo->tm_mday;
  hour = timeinfo->tm_hour;
  minute = timeinfo->tm_min;
  second = timeinfo->tm_sec;

  millisecond = milliseconds % 1000;

  // Format the string
  char buffer[32];
  sprintf(buffer, "%04d_%02d_%02d - %02d-%02d-%02d_%03d", year, month, day,
          hour, minute, second, millisecond);

  return String(buffer);
}

void createMeasurementFile() {
  if (!is_sd_card_available) {
    cout << "Error: Couldn't write measurements to disk - SD card not "
            "available."
         << endl;
    return;
  }
  if (!sd.exists("/measurements")) {
    cout << "Creating /measurements folder on sd-card" << endl;
    if (!sd.mkdir("/measurements")) {
      cout << "Error: Couldn't create /measurements directory. Check SD-Card."
           << endl;
      return;
    }
  }
  measurement_file_name =
      "/measurements/" + millisecondsToTimeString(start_timestamp);
  uint8_t retries = 0;
  while (sd.exists(measurement_file_name.c_str())) {
    ++retries;
    measurement_file_name =
        "/measurements/" + millisecondsToTimeString(start_timestamp);
    +"_" + String(retries);
  }
  cout << "Creating file " << measurement_file_name << endl;
  if (!measurement_file.open(measurement_file_name.c_str(),
                             O_WRONLY | O_CREAT | O_TRUNC)) {
    cout << "Failed to create file " << measurement_file_name << endl;
  }
  measurement_file.close();
}

void wait_forever() {
  cout << "Waiting forever" << endl;
  while (1) {
    delay(1000);
  }
}

void setup() {
  // Debug serial connected to USB
  Serial.begin(115200);
  while (!Serial) {
    delay(1);
  }
  delay(500);

  // Print greeting message
  cout << endl;
  cout << "Starting Infrasound Sensor" << endl;
  cout << ARDUINO_BOARD << endl;
  cout << "##########################" << endl;

  // Connection to Arduino serial using software serial
  cout << "Connecting to Sensor Board" << endl;
  esp_serial.begin(9600, SWSERIAL_8N1, MYPORT_RX, MYPORT_TX, false);
  if (!esp_serial) {
    cout << "Invalid EspSoftwareSerial pin configuration, check config!";
    // don't continue with broken configuration
    wait_forever();
  }
  cout << "Connection to Sensor Board established" << endl;

  // Initialize SD-Card
  while (!initSdCard()) {
    cout << "Failed to initialize SD-Card..." << endl;
    delay(1000);
    cout << "Trying again" << endl;
  }

  // init wifi
  initWifi();
  // init time
  if (is_wifi_client) {
    initTimestamp();
  }

  // createMeasurementFile();

