keyraphi/esp8266_infrasound/esp8266_infrasound_webservre/esp8266_infrasound_webserver.ino.cpp
  // Setup Webserver
  initWebserver();
}

bool openMeasurementFileAppending() {
  if (!measurement_file.open(measurement_file_name.c_str(),
                             O_WRONLY | O_APPEND | O_AT_END)) {
    cout << "Failed to open measurement file: " << measurement_file_name
         << endl;
    return false;
  }
  return true;
}

void sendMeasurementEvent(uint32_t measurement_idx, float measurement) {
  char idx_string[11];         // 10 bytes for uint32_t
  char measurement_string[21]; // 21 bytes for float
  char semicolon_str[2];
  strcpy(semicolon_str, ";");
  utoa(measurement_idx, idx_string, 10);
  dtostrf(measurement, -1, 7, measurement_string);
  char message[32];
  strcpy(message, idx_string);
  strcat(message, semicolon_str);
  strcat(message, measurement_string);
  // cout << "DEBUG: event message string: " << message << endl;
  events.send(message, "measurement", millis(), false);
}

void writeMeasurementFileBuffer() {
  if (create_new_measurement_file) {
    createMeasurementFile();
    create_new_measurement_file = false;
  }
  cout << "Writing " << measurements_in_file_buffer
       << " measurements to SD Card" << endl;
  if (!openMeasurementFileAppending()) {
    return;
  }
  // Write measurement file buffer to file
  if (measurement_file.write(
          reinterpret_cast<uint8_t *>(measurement_file_buffer),
          measurements_in_file_buffer * 4) != 4 * measurements_in_file_buffer) {
    cout << "Writing measurement to ssd failed" << endl;
  }
  measurement_file.close();
  measurements_in_file_buffer = 0;
}

void handleNewMeasurements() {
  if (measurements_in_file_buffer > measurement_file_buffer_size - 8) {
    writeMeasurementFileBuffer();
  }
  // Send data from buffer directly through event socket
  for (uint32_t i = 0; i < measurements_buffer.available(); ++i) {
    float measurement = measurements_buffer.pop();
    uint32_t measurement_idx =
        indices_buffer.pop(); // NOTE: we assume that this buffer always has the
                              // same size!
    measurement_file_buffer[measurements_in_file_buffer++] = measurement;
    // Send via websocket
    sendMeasurementEvent(measurement_idx, measurement);
  }
}

float previous_measurement = -4200;
size_t good_sync_messages = 0;
size_t bad_sync_messages = 0;

// Automatically syncing serial connection
bool getMeasurementFromArduino(uint32_t *measurement_idx, float *value) {
  // Syncing
  if (esp_serial.available() < 10) {
    return false;
  }
  // Read a byte and drop it unless a full one byte is read, which signalizes
  // the start of a package
  bool is_package_start_synchronized = false;
  char package_start;
  esp_serial.read(&package_start, 1);
  is_package_start_synchronized = package_start == '\xFF';
  // cout << "DEBUG: got package start: " << static_cast<int>(package_start) <<
  // " and is_package_start_synchronized: " << is_package_start_synchronized <<
  // endl;
  if (!is_package_start_synchronized) {
    cout << "Waiting for valid package start ..." << endl;
    return false;
  }
  // read the value of the measurment
  esp_serial.read(reinterpret_cast<char *>(value), 4);
  // read the index of the measurement
  esp_serial.read(reinterpret_cast<char *>(measurement_idx), 4);

  // read the final byte
  char package_end;
  esp_serial.read(&package_end, 1);
  if (package_end != '\x00') {
    cout << "Package end is not 0 - dropping the pakcage with idx "
         << *measurement_idx << " and value " << *value << endl;
    return false;
  }
  // cout << "DEBUG read index: " << *measurement_idx << ", and value: " <<
  // *value << endl;

  return true;
}

void checkArdinoForMeasurements() {
  while (esp_serial.available() >= 10) {
    uint32_t measurement_idx;
    float measurement;
    if (!getMeasurementFromArduino(&measurement_idx, &measurement)) {
      return;
    }
    bool push_success = measurements_buffer.push(measurement);
    push_success &= indices_buffer.push(measurement_idx);
    if (!push_success) {
      cout << "WARNING: measurement and index buffer ran full ... dropping "
              "measurements!"
           << endl;
    }
  }
}

void loop() {
  if (is_measurement_running) {
    checkArdinoForMeasurements();
    if (measurements_buffer.available() > 0) {
      // Let clients know about the new measurements and write everything new to
      // the event socket and file
      handleNewMeasurements();
    }
  }
}
